budget/Documents/ПланБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланБюджета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланБюджетаРС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланыБюджета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

budget/InformationRegisters/ПланБюджетаРС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланБюджетаРС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

budget/Documents/ПланБюджета/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ЗаполнитьПоПрошломуНаСервере(ПериодТ)
	
	ПланПоСтатьям = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПланБюджетаРССрезПоследних.Статья КАК Статья,
					|	ПланБюджетаРССрезПоследних.СуммаПлан КАК СуммаПлан,
					|	ПланБюджетаРССрезПоследних.Период КАК ПериодСреза
					|ИЗ
					|	РегистрСведений.ПланБюджетаРС.СрезПоследних(&ПериодТ) КАК ПланБюджетаРССрезПоследних";   
	
	Запрос.УстановитьПараметр("ПериодТ", ПериодТ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПериодСреза <> ПериодТ Тогда
			Возврат неопределено;
		КонецЕсли;
		ПланПоСтатьям.Вставить(Выборка.Статья, Выборка.СуммаПлан);
	КонецЦикла; 	
	
	Возврат ПланПоСтатьям;     
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоПрошлому(Команда)     
	
	Объект.ПланыБюджета.Очистить();
	
	ПериодТ = ДобавитьМесяц(НачалоМесяца(Объект.Дата), -1); 
	ПланПоСтатьям = ЗаполнитьПоПрошломуНаСервере(ПериодТ);
	
	Если 	ПланПоСтатьям = неопределено Тогда
		ПоказатьПредупреждение(, "За прошлый месяц нет плановых данных для заполнения!");
		Возврат;		
	КонецЕсли;
	
	Для каждого Пара Из ПланПоСтатьям Цикл
	
		НоваяСтрока = Объект.ПланыБюджета.Добавить();
		НоваяСтрока.Статья = Пара.Ключ;
		НоваяСтрока.Сумма = Пара.Значение;
	
	КонецЦикла;
			
 КонецПроцедуры
